#### 3. Import the required packages with their customary aliases as follows:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Below is a magic command so that your plots show in the notebook without having to call plt.show() every time.

In [2]:
%matplotlib inline

In [48]:
#gdp_df =pd.read_csv('C:/Users/dpatel/Documents/NSS_Data_Analytics/projects/gdp-and-internet-usage-dpatelaqua/data/gdp_percapita.csv')
gdp_df =pd.read_csv('../data/gdp_percapita.csv')
gdp_df.head(n=6) #n=6 provides 6 rows of data instead of the standard 5 rows

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  2190.240321              NaN
1     Afghanistan  2017  2202.570851              NaN
2     Afghanistan  2016  2200.764487              NaN
3     Afghanistan  2015  2212.750899              NaN
4     Afghanistan  2014  2249.253738              NaN
5     Afghanistan  2013  2264.317575              NaN

nrows argument is added due to the footnotes at the end of the file cause errors reading the file into the data frame

In [27]:
internet_df =pd.read_csv('../data/internet_use.csv',nrows=4495)
internet_df.head(n=6) #n=6 provides 6 rows of data instead of the standard 5 rows

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

7. The data frames have 4 columns in both files

In [25]:
gdp_df.info

<bound method DataFrame.info of      Country or Area                                      Year        Value  \
0        Afghanistan                                      2018  2190.240321
1        Afghanistan                                      2017  2202.570851
2        Afghanistan                                      2016  2200.764487
3        Afghanistan                                      2015  2212.750899
4        Afghanistan                                      2014  2249.253738
...              ...                                       ...          ...
6603        Zimbabwe                                      1992  3054.889178
6604        Zimbabwe                                      1991  3426.598094
6605        Zimbabwe                                      1990  3324.348171
6606   footnoteSeqID                                  Footnote          NaN
6607               2  Excludes South Sudan after July 9, 2011.          NaN

      Value Footnotes
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
6603              NaN
6604              NaN
6605              NaN
6606              NaN
6607              NaN

[6608 rows x 4 columns]>

The Output of gdp_df = 6608rows x 4 columns

In [28]:
internet_df.info

<bound method DataFrame.info of      Country or Area  Year     Value  Value Footnotes
0        Afghanistan  2014  6.390000              NaN
1        Afghanistan  2013  5.900000              NaN
2        Afghanistan  2012  5.454545              NaN
3        Afghanistan  2011  5.000000              NaN
4        Afghanistan  2010  4.000000              NaN
...              ...   ...       ...              ...
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

[4495 rows x 4 columns]>

The Output 4495 rows x 4 columns

In [31]:
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

gdp_df has the following following data types:-

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [32]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

The internet_df has the following data types:

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

Take a look at the last 10 rows of each DataFrame in turn.

In [34]:
gdp_df.tail(10)

,Country or Area,Year,Value,Value Footnotes
6598,Zimbabwe,1997,3580.048793,NaN
6599,Zimbabwe,1996,3520.430146,NaN
6600,Zimbabwe,1995,3226.413930,NaN
6601,Zimbabwe,1994,3263.934978,NaN
6602,Zimbabwe,1993,3033.504852,NaN
6603,Zimbabwe,1992,3054.889178,NaN
6604,Zimbabwe,1991,3426.598094,NaN
6605,Zimbabwe,1990,3324.348171,NaN
6606,footnoteSeqID,Footnote,NaN,NaN
6607,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [38]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

#### 10. Drop the value footnotes column from both DataFrames. Check that this worked as expected.

In [49]:
gdp_df.drop(columns=['Value Footnotes'],inplace=True)
gdp_df.head(10)

  Country or Area  Year        Value
0     Afghanistan  2018  2190.240321
1     Afghanistan  2017  2202.570851
2     Afghanistan  2016  2200.764487
3     Afghanistan  2015  2212.750899
4     Afghanistan  2014  2249.253738
5     Afghanistan  2013  2264.317575
6     Afghanistan  2012  2220.481526
7     Afghanistan  2011  2037.608607
8     Afghanistan  2010  2093.743565
9     Afghanistan  2009  1881.777626

In [47]:
internet_df.drop(columns=['Value Footnotes'],inplace=True)
internet_df.head(10)

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000
5     Afghanistan  2009  3.550000
6     Afghanistan  2008  1.840000
7     Afghanistan  2007  1.900000
8     Afghanistan  2006  2.107124
9     Afghanistan  2005  1.224148

#### 11.Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [55]:
gdp_df = gdp_df.rename(columns ={'Country or Area':'Country','Value':'GDP_Per_Capita'})
gdp_df.head(10)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     2190.240321
1  Afghanistan  2017     2202.570851
2  Afghanistan  2016     2200.764487
3  Afghanistan  2015     2212.750899
4  Afghanistan  2014     2249.253738
5  Afghanistan  2013     2264.317575
6  Afghanistan  2012     2220.481526
7  Afghanistan  2011     2037.608607
8  Afghanistan  2010     2093.743565
9  Afghanistan  2009     1881.777626

The Other method that could be used.  
new_col_names_int = ['Country','Year','Internet_Users_Pct']  
internet_df.columns = new_col_names_int  
internet_df

#### 12. Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [56]:
internet_df = internet_df.rename(columns = {'Country or Area':'‘Country','Value':'Internet_Users_Pct'})
internet_df.head(10)

      ‘Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000
5  Afghanistan  2009            3.550000
6  Afghanistan  2008            1.840000
7  Afghanistan  2007            1.900000
8  Afghanistan  2006            2.107124
9  Afghanistan  2005            1.224148

#### 13. Merge the two DataFrames to one. Merge all rows from each of the two DataFrames.  Call the new DataFrame gdp_and_internet_use.

In [ ]:
gdp_and_internet_use = gpd_df.merge(internet_df)